Repository: TunaZ06971/MakeUp
Catalog: apple/MakeUpApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh, zh_hans

# scan.eyebrow
source: Guided camera capture
zh: 摄像头引导采集

# scan.title
source: Build your 3D face
zh: 建立你的 3D 人脸

# scan.model
source: My 3D face
zh: 我的 3D 人脸

# scan.close
source: Close
zh: 关闭

# scan.intro
source: Turn your head. Capture your own face.
zh: 转动头部，采集属于你的脸型

# scan.rgbNotice
source: A standard camera creates an estimated surface in relative units. Use ARKit on an iPhone with TrueDepth for the primary acquisition route.
zh: 普通摄像头生成相对尺度的估算面部网格。更可靠的几何请使用 iPhone 的 ARKit / TrueDepth 采集。

# scan.deviceAdvice
source: Capture on iPhone and AirDrop the model file here, or use this computer’s camera.
zh: 推荐用 iPhone 采集后，将模型文件通过 AirDrop 导入这里；也可以直接用本机摄像头。

# scan.privacy
source: No microphone. Frames, geometry and expressions stay on this device. Only an explicit export creates a transferable file. This is not identity verification.
zh: 摄像头不录音。采集帧、几何和表情只保存在本设备；只有你主动导出时才生成可转移文件。此流程不是身份认证。

# scan.startCamera
source: Enable camera and begin
zh: 开启摄像头并开始

# scan.start
source: Start capture
zh: 开始采集

# scan.rescan
source: Capture again
zh: 重新采集

# scan.retry
source: Start again
zh: 重新开始

# scan.local
source: On device only
zh: 仅本机

# scan.vertices
source: vertices
zh: 顶点

# scan.updating
source: Updating makeup
zh: 更新妆容

# scan.leftView
source: Left
zh: 左侧

# scan.frontView
source: Front
zh: 正面

# scan.rightView
source: Right
zh: 右侧

# scan.wire
source: Wireframe
zh: 网格

# scan.rotate
source: Rotate mode
zh: 旋转模式

# scan.exportGLB
source: Export GLB
zh: 导出 GLB

# scan.import
source: Import model file
zh: 导入模型文件

# scan.export
source: Export capture package
zh: 导出采集包

# scan.delete
source: Delete local model
zh: 删除本机模型

# scan.photos
source: Photo tools (legacy)
zh: 照片工具（兼容旧流程）

# scan.back
source: Back to 3D face
zh: 返回 3D 人脸

# scan.surfaceNotice
source: Drag to rotate, scroll to zoom. This is a captured face surface, without hair, ears or the back of the head. Texture retains the capture lighting.
zh: 可拖动旋转、滚轮缩放。当前模型覆盖采到的面部表面，不含头发、耳朵、后脑；纹理保留采集时的光照。

# scan.sources.mediapipe-rgb
source: Standard camera · estimated geometry
zh: 普通摄像头 · 估算几何

# scan.sources.arkit-truedepth
source: iPhone TrueDepth · ARKit face mesh
zh: iPhone TrueDepth · ARKit 面部网格

# scan.sources.arkit-rgb
source: ARKit · standard camera
zh: ARKit · 普通摄像头

# scan.steps.front
source: Look straight ahead and relax
zh: 正视镜头，放松脸部

# scan.steps.left
source: Slowly turn your head left
zh: 慢慢向左转头

# scan.steps.right
source: Slowly turn your head right
zh: 慢慢向右转头

# scan.steps.up
source: Gently look up
zh: 轻轻抬头

# scan.steps.down
source: Gently look down
zh: 轻轻低头

# scan.steps.blink
source: Face forward, close your eyes, then reopen
zh: 正视镜头，闭眼一下再睁开

# scan.steps.mouth
source: Face forward, open your mouth, then close
zh: 正视镜头，张嘴再合上

# scan.steps.finish
source: Face forward once more and relax
zh: 最后正视镜头，保持放松

# scan.short.front
source: Front
zh: 正面

# scan.short.left
source: Left
zh: 左转

# scan.short.right
source: Right
zh: 右转

# scan.short.up
source: Up
zh: 抬头

# scan.short.down
source: Down
zh: 低头

# scan.short.blink
source: Blink
zh: 眨眼

# scan.short.mouth
source: Mouth
zh: 张嘴

# scan.short.finish
source: Finish
zh: 完成

# scan.feedback.hold
source: Hold the pose until the progress bar fills
zh: 保持当前动作，进度填满后自动采集

# scan.feedback.starting
source: Starting camera and local face model…
zh: 正在启动摄像头和本地识别模型…

# scan.feedback.noFace
source: Keep your entire face in view
zh: 请让整张脸出现在画面中

# scan.feedback.oneFace
source: Only one face may be in the frame
zh: 画面中只能有一张脸

# scan.feedback.center
source: Center your entire face in the frame
zh: 请将整张脸移到画面中央

# scan.feedback.closer
source: Move a little closer
zh: 请靠近一点

# scan.feedback.farther
source: Move a little farther away
zh: 请离镜头远一点

# scan.feedback.dark
source: Too dark — face an even light source
zh: 光线偏暗，请面向光源

# scan.feedback.bright
source: Too bright — avoid direct harsh light
zh: 画面过亮，请避开强光直射

# scan.feedback.blur
source: Image is soft — hold still and clean the lens
zh: 画面不够清晰，请保持稳定并清洁镜头

# scan.feedback.level
source: Keep your head upright without tilting sideways
zh: 请保持头部端正，不要侧歪

# scan.feedback.front
source: Return to the front first
zh: 请先回到正面

# scan.feedback.relax
source: Open your eyes, close your mouth and relax
zh: 请睁眼、合嘴，恢复自然表情

# scan.feedback.building
source: Fusing neutral geometry and multiple texture views…
zh: 正在融合中性脸型和多角度纹理…

# scan.feedback.secure
source: Camera access requires HTTPS or localhost
zh: 摄像头需要 HTTPS 或 localhost，请使用安全地址打开

# scan.feedback.denied
source: Camera permission denied. Allow it in browser settings, then retry
zh: 摄像头权限被拒绝。请在浏览器设置中允许后重试

# scan.feedback.cameraError
source: Camera unavailable. Close other camera apps and retry
zh: 无法打开摄像头，请关闭其他占用摄像头的程序后重试

# scan.feedback.detectorError
source: Local face model failed to load. Check model files and retry
zh: 本地识别模型加载失败，请检查模型文件并重试

# scan.feedback.interrupted
source: Camera stopped when this page went into the background. Start again
zh: 切换到后台后已关闭摄像头，请重新开始

# scan.feedback.buildError
source: Could not process this model. Check the file or capture again
zh: 模型处理失败，请检查文件格式或重新采集

# scan.feedback.unsupported
source: Use a physical iPhone that supports ARKit face tracking. The simulator cannot capture. You can also import a model.
zh: 需要支持 ARKit 人脸追踪的 iPhone 真机；模拟器无法采集。你也可以导入已有模型。

# app.name
source: MakeUp
zh_hans: 试妆

# app.tagline
source: Try every shade on your own face
zh_hans: 在自己的脸上试遍每一支色号

# auth.displayName
source: Display name
zh_hans: 昵称

# auth.email
source: Email
zh_hans: 邮箱

# auth.error.emailInUse
source: That email is already registered. Try signing in instead.
zh_hans: 这个邮箱已经注册过了，直接登录吧。

# auth.error.generic
source: Something went wrong. Please try again.
zh_hans: 出错了，请再试一次。

# auth.error.invalidCredential
source: Email or password is incorrect.
zh_hans: 邮箱或密码不对。

# auth.error.invalidEmail
source: That email address doesn't look right.
zh_hans: 邮箱格式不正确。

# auth.error.missingPassword
source: Enter your password.
zh_hans: 请输入密码。

# auth.error.network
source: Can't reach the server. Check your network, or whether the local emulator is running.
zh_hans: 连不上服务器，检查一下网络或本地模拟器是否已启动。

# auth.error.tooManyRequests
source: Too many attempts. Try again in a moment.
zh_hans: 尝试次数过多，请稍后再试。

# auth.error.weakPassword
source: Password is too short — use at least 6 characters.
zh_hans: 密码太短了，至少需要 6 位。

# auth.login.forgot
source: Forgot your password?
zh_hans: 忘记密码？

# auth.login.noAccount
source: No account yet?
zh_hans: 还没有账号？

# auth.login.signupLink
source: Create one
zh_hans: 注册一个

# auth.login.submit
source: Sign in
zh_hans: 登录

# auth.login.title
source: Sign in
zh_hans: 登录

# auth.password
source: Password
zh_hans: 密码

# auth.passwordHint
source: At least 6 characters
zh_hans: 至少 6 位

# auth.reset.sent %@
source: Reset email sent to %@. Check your inbox.
zh_hans: 重置邮件已发送到 %@，请查收。

# auth.reset.submit
source: Send reset email
zh_hans: 发送重置邮件

# auth.reset.subtitle
source: We'll email you a link to set a new password
zh_hans: 我们会给你的邮箱发一封重置密码的邮件

# auth.reset.title
source: Reset password
zh_hans: 重置密码

# auth.signOut
source: Sign out
zh_hans: 退出登录

# auth.signup.submit
source: Create account
zh_hans: 创建账号

# auth.signup.subtitle
source: Sign up to import a photo and start trying shades on
zh_hans: 创建账号后即可导入照片开始试妆

# auth.signup.title
source: Create account
zh_hans: 注册

# auth.working
source: Working…
zh_hans: 处理中…

# catalog.all
source: All
zh_hans: 全部

# catalog.empty
source: No matching products.
zh_hans: 没有匹配的产品。

# catalog.error
source: Couldn't load products. Check that the local emulator is running.
zh_hans: 产品加载失败，检查一下本地模拟器是否在运行。

# catalog.loading
source: Loading…
zh_hans: 加载中…

# catalog.searchPlaceholder
source: Search brand or shade
zh_hans: 搜品牌或色号

# catalog.title
source: Catalog
zh_hans: 产品库

# category.blush
source: Blush
zh_hans: 腮红

# category.brow
source: Brow
zh_hans: 眉笔

# category.eyeliner
source: Eyeliner
zh_hans: 眼线

# category.eyeshadow
source: Eyeshadow
zh_hans: 眼影

# category.foundation
source: Foundation
zh_hans: 粉底

# category.highlighter
source: Highlighter
zh_hans: 高光

# category.lipstick
source: Lipstick
zh_hans: 口红

# face.addView
source: Add an angle
zh_hans: 加一个角度

# face.empty
source: Import a front-facing photo to start trying makeup on. Even lighting and clearly visible features work best.
zh_hans: 导入一张正脸照片，就可以开始试妆了。光线均匀、五官清晰的照片效果最好。

# face.import
source: Import a photo
zh_hans: 导入照片

# face.multiViewHint
source: Add a few profile shots to see the same look from other angles.
zh_hans: 再传几张侧脸照片，就能从不同角度看同一套妆容的效果。

# face.privacy
source: Photos stay on this device — nothing is uploaded.
zh_hans: 照片只保存在这台设备上，不会上传到云端。

# face.removeView
source: Remove this angle
zh_hans: 删除这个角度

# face.replace
source: Replace
zh_hans: 换一张

# face.status.detected %lld
source: Detected — %lld landmarks located.
zh_hans: 识别成功，定位到 %lld 个关键点。

# face.status.detecting
source: Detecting face…
zh_hans: 正在识别人脸…

# face.status.failed
source: Detection failed. Please try again.
zh_hans: 识别出错了，请重试。

# face.status.noFace
source: No face found in this photo. Try a front-facing, well-lit one.
zh_hans: 没有在这张照片里找到人脸，换一张正脸、光线充足的试试。

# face.title
source: My face
zh_hans: 我的脸

# finish.dewy
source: Dewy
zh_hans: 水光

# finish.glitter
source: Glitter
zh_hans: 闪片

# finish.matte
source: Matte
zh_hans: 哑光

# finish.metallic
source: Metallic
zh_hans: 金属

# finish.satin
source: Satin
zh_hans: 缎光

# finish.sheer
source: Sheer
zh_hans: 薄透

# finish.shimmer
source: Shimmer
zh_hans: 珠光

# home.greeting %@
source: Hi, %@
zh_hans: 你好，%@

# language.label
source: Language
zh_hans: 语言

# looks.empty
source: No looks saved yet. Save one and it replays on any angle or any photo.
zh_hans: 还没保存过妆容。上妆之后可以存下来，换个角度或换张照片都能重新套用。

# looks.itemCount %lld
source: %lld products
zh_hans: %lld 件产品

# looks.namePlaceholder
source: Name this look
zh_hans: 给这套妆容起个名字

# looks.save
source: Save
zh_hans: 保存

# looks.title
source: My looks
zh_hans: 我的妆容

# looks.untitled
source: Untitled look
zh_hans: 未命名妆容

# status.connecting
source: Connecting…
zh_hans: 连接中…

# tryOn.applied
source: Applied
zh_hans: 已上妆

# tryOn.brush
source: Brush
zh_hans: 画笔

# tryOn.brushFlow
source: Flow
zh_hans: 上色浓度

# tryOn.brushSize
source: Size
zh_hans: 笔头大小

# tryOn.clearAll
source: Remove all
zh_hans: 全部卸掉

# tryOn.intensity
source: Intensity
zh_hans: 浓淡

# tryOn.modeAuto
source: One tap
zh_hans: 一键上妆

# tryOn.modeAutoHint
source: Picking a product applies it to the right area
zh_hans: 选中产品自动涂到对应部位

# tryOn.modePaint
source: Paint by hand
zh_hans: 手动涂抹

# tryOn.modePaintHint
source: Picking a product turns it into a brush — drag on the face
zh_hans: 选中产品当画笔，在脸上拖动涂抹

# tryOn.pickBrushProduct
source: Pick a product below to turn it into a brush.
zh_hans: 先在下面选一款产品，它就会变成画笔。

# viewport.tools
source: Photo tools
zh_hans: 照片工具

# viewport.zoomOut
source: Zoom out
zh_hans: 缩小

# viewport.zoomIn
source: Zoom in
zh_hans: 放大

# viewport.fit
source: Fit
zh_hans: 适合窗口

# viewport.move
source: Move
zh_hans: 移动

# viewport.showOriginal
source: Show original
zh_hans: 查看原图

# viewport.showMakeup
source: Show makeup
zh_hans: 返回妆容

# viewport.export
source: Export photo
zh_hans: 导出照片

# viewport.original
source: Original
zh_hans: 原图

# viewport.makeup
source: Try-on preview
zh_hans: 试妆预览

# viewport.paintHint
source: Drag to paint · Pinch to zoom · Option-drag to move on Mac
zh_hans: 拖动涂抹 · 双指缩放移动 · Mac 按住 Option 移动

# viewport.moveHint
source: Scroll or pinch to zoom · Drag to move
zh_hans: 滚轮或双指缩放 · 拖动移动

# viewport.renderError
source: Rendering could not start. Reload the photo or use a browser that supports WebGL.
zh_hans: 渲染未能启动，请重新载入照片或使用支持 WebGL 的浏览器。

# studio.subtitle
source: Find your next look, on your own face
zh_hans: 在自己的脸上，找到喜欢的妆容

source: Studio panels
zh_hans: 试妆工具

# studio.products
source: Products
zh_hans: 选产品

# studio.applied
source: Your look
zh_hans: 当前妆容

# studio.looks
source: Saved looks
zh_hans: 已存妆容

# errors.photos
source: Could not read or save this photo. Use JPEG, PNG or WebP and check local storage space.
zh_hans: 照片无法读取或保存。请使用 JPEG、PNG 或 WebP 格式，并检查本地存储空间。

# errors.looks
source: The action could not be completed. Check your connection and try again.
zh_hans: 操作未完成，请检查连接后重试。

# extra.undo
source: Undo stroke
zh_hans: 撤销笔触

# extra.redo
source: Redo stroke
zh_hans: 重做笔触

# viewport.exportError
source: Could not export the photo. Please try again.
zh_hans: 照片导出失败，请重试。

# scan.prepare
source: Keep the camera steady with your face, hair and ears in view and soft light in front. You can capture just one side without filming the back. Keep a neutral expression during turns.
zh_hans: 摄像头保持稳定，让整张脸、发顶和耳朵入镜，面向柔和光源。可只采左侧或右侧，不需要拍后脑；转头时保持自然表情。

# scan.localEntry
source: Capture 3D face on this device
zh_hans: 无需登录 · 本机 3D 采集

# scan.backToLogin
source: Back to sign in
zh_hans: 返回登录

# scan.measuredMode
source: Measure visible head depth (experimental)
zh_hans: 测量可见头部深度（实验功能）

# scan.measuredNotice
source: Uses raw TrueDepth measurements, not the ARKit face template. Visible hair and ears may be retained when the sensor observes them. Missing regions stay open. Real-device quality has not been verified yet.
zh_hans: 使用 TrueDepth 原始测量，不以 ARKit 人脸模板作为成品。传感器测到的可见头发与耳朵可参与重建，缺失区域保持空缺。尚未完成真机质量验收。

# scan.coarseNotice
source: Quick coarse face template; no hair, ears or complete head reconstruction.
zh_hans: 快速粗略脸部模板，不含头发、耳朵，不是完整头部重建。

# scan.captureSide
source: Available capture direction
zh_hans: 可拍摄方向

# scan.captureLeft
source: Front + left side (up to 90°)
zh_hans: 正脸 + 左侧（不超过 90°）

# scan.captureRight
source: Front + right side (up to 90°)
zh_hans: 正脸 + 右侧（不超过 90°）

# scan.captureBoth
source: Small turns to both sides
zh_hans: 左右各小幅转头

# scan.steps.leftProfile
source: Continue slowly left to about 60°, never beyond 90°
zh_hans: 继续慢慢向左转，约 60°，不要超过 90°

# scan.steps.rightProfile
source: Continue slowly right to about 60°, never beyond 90°
zh_hans: 继续慢慢向右转，约 60°，不要超过 90°

# scan.sources.truedepth-measured
source: TrueDepth · measured visible surface (experimental)
zh_hans: TrueDepth · 测量可见表面（实验功能）

# scan.feedback.noDepth
source: No synchronized, calibrated TrueDepth data. Use a TrueDepth iPhone, keep your face in view and retry. Do not use Simulator.
zh_hans: 没有获取到同步且标定有效的 TrueDepth 数据。请使用有 TrueDepth 的真实 iPhone，将脸保持在画面中后重试。模拟器无法采集。

# scan.feedback.waitingDepth
source: Waiting for synchronized depth measurements…
zh_hans: 正在等待同步的原始深度数据…

# scan.feedback.insufficientDepth
source: Not enough reliable depth to build a surface. Keep the whole head in frame, use soft light and move slowly. The previous model was retained.
zh_hans: 可靠深度不足，暂时无法生成表面。请让整个头部入镜，在柔和光线下慢慢转头。原有模型已保留。

# scan.measuredSurfaceNotice
source: Measured visible regions only. Unseen areas remain missing; hair strands and hidden ear folds are not reconstructed. Expressions are not applied to this measured surface.
zh_hans: 仅包含测到的可见区域。未拍到的部分仍缺失；不重建单根发丝或耳内遮挡结构。测量表面暂不支持表情变形。

# scan.skipProfile
source: Cannot track this angle — continue without it
zh_hans: 此角度无法跟踪，继续采集其他视角
